
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Дата = ТекущаяДатаСеанса();
	Страна = "ru";
КонецПроцедуры

&НаКлиенте
Процедура ПроверитьДату(Команда)
	ТекстЗапроса = Формат(Дата,"ДФ=yyyy-MM-dd;"); // Формируем в теле запроса дату
	СтруктураОтвета = ПолучитьДанныеНаСервере(ТекстЗапроса);
 	
	Если СтруктураОтвета.Ошибка Тогда
		Сообщить(СтруктураОтвета.ОписаниеОшибки);
	Иначе
		Сообщить(СтруктураОтвета.ТипДня);	
	КонецЕсли;
КонецПроцедуры

&НаСервере
Функция ПолучитьДанныеНаСервере(ТекстЗапроса)
	Если РаспознаватьСокращенныеДни Тогда
		ТекстЗапроса = ТекстЗапроса + "?pre=1";
	КонецЕсли;
	Если УчитыватьКовид Тогда
		ТекстЗапроса = ТекстЗапроса + "?covid=1";
	КонецЕсли;
	Если ЗначениеЗаполнено(Страна) Тогда
		ТекстЗапроса = ТекстЗапроса + "?cc=" + Страна;
	КонецЕсли;
	
	
	Соединение = Новый HTTPСоединение("isdayoff.ru");
	
	Заголовки = Новый Соответствие;
	Заголовки.Вставить("User-Agent","CrazyElephant_X-1c-1.01 (79636902266@ya.ru)");
	
	Запрос = Новый HTTPЗапрос("/" + ТекстЗапроса,Заголовки);
	Ответ = Соединение.Получить(Запрос);
	
	СтруктураОтвета = ОбработатьРезультатЗапроса(Ответ.КодСостояния,Ответ.ПолучитьТелоКакСтроку());
	
	Возврат СтруктураОтвета;
КонецФункции

&НаСервере
Функция ОбработатьРезультатЗапроса(КодСостояния,ТелоОтвета)
	
	СтруктураОтвета = Новый Структура;
	СтруктураОтвета.Вставить("Ошибка",Ложь);
	СтруктураОтвета.Вставить("ОписаниеОшибки","");
	СтруктураОтвета.Вставить("ТипДня","");
	
	Если КодСостояния = 200 Тогда
		Если ТелоОтвета = "0" Тогда
			СтруктураОтвета.ТипДня = "Рабочий день";
		ИначеЕсли ТелоОтвета = "1" Тогда
			СтруктураОтвета.ТипДня = "Нерабочий день";
		ИначеЕсли ТелоОтвета = "2" Тогда
			СтруктураОтвета.ТипДня = "Предпраздничный день";
		ИначеЕсли ТелоОтвета = "4" Тогда
			СтруктураОтвета.ТипДня = "Рабочий день"; //covid
		Иначе
			ТипДня = "Что-то сломалось";
		КонецЕсли;
	ИначеЕсли КодСостояния = 400 Тогда
		СтруктураОтвета.Ошибка = Истина;
		СтруктураОтвета.ОписаниеОшибки = "Ошибка в дате/коде страны";	 
	ИначеЕсли КодСостояния = 404 Тогда
		СтруктураОтвета.Ошибка = Истина;
		СтруктураОтвета.ОписаниеОшибки = "Данные не найдены";
	Иначе
		СтруктураОтвета.Ошибка = Истина;
		СтруктураОтвета.ОписаниеОшибки = "Код ответа: " + КодСостояния;
	КонецЕсли;
	
	Возврат СтруктураОтвета;
КонецФункции

&НаКлиенте
Процедура УчитыватьСтрануПриИзменении(Элемент)
	НастройкаВидимости();
КонецПроцедуры

&НаКлиенте
Процедура НастройкаВидимости()
	Элементы.Страна.Видимость = УчитыватьСтрану;
	
	Если НЕ УчитыватьСтрану Тогда
		Страна = "ru";
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	НастройкаВидимости();
КонецПроцедуры

// https://isdayoff.ru/today
// https://isdayoff.ru/tomorrow
// https://isdayoff.ru/now