
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Дата = ТекущаяДатаСеанса();
	Страна = "ru";
КонецПроцедуры

&НаКлиенте
Процедура ПроверитьДату(Команда)
	ТекстЗапроса = Формат(Дата,"ДФ=yyyy-MM-dd;");
	СтруктураОтвета = ПолучитьДанныеНаСервере(ТекстЗапроса);
 	
	Если СтруктураОтвета.Ошибка Тогда
		Сообщить(СтруктураОтвета.ОписаниеОшибки);
	Иначе
		Если СтруктураОтвета.Ответ = "0" Тогда
			ТипДня = "Рабочий день";
		ИначеЕсли СтруктураОтвета.Ответ = "1" Тогда
			ТипДня = "Нерабочий день";
		Иначе
			ТипДня = "Что-то сломалось";
		КонецЕсли;
		Сообщить(ТипДня);	
	КонецЕсли;
КонецПроцедуры

&НаСервере
Функция ПолучитьДанныеНаСервере(ТекстЗапроса)
	Если ЗначениеЗаполнено(Страна) Тогда
		ТекстЗапроса = ТекстЗапроса + "?cc=" + Страна;
	КонецЕсли;
	
	Соединение = Новый HTTPСоединение("isdayoff.ru");
	Запрос = Новый HTTPЗапрос("/" + ТекстЗапроса);
	Ответ = Соединение.Получить(Запрос);
	
	СтруктураОтвета = ОбработатьРезультатЗапроса(Ответ.КодСостояния,Ответ.ПолучитьТелоКакСтроку());
	
	Возврат СтруктураОтвета;
КонецФункции

&НаСервере
Функция ОбработатьРезультатЗапроса(КодСостояния,ТелоОтвета)
	
	СтруктураОтвета = Новый Структура;
	СтруктураОтвета.Вставить("Ошибка",Ложь);
	СтруктураОтвета.Вставить("ОписаниеОшибки","");
	СтруктураОтвета.Вставить("Ответ",ТелоОтвета);
	
	Если КодСостояния = 200 Тогда
	
	ИначеЕсли КодСостояния = 400 Тогда
		СтруктураОтвета.Ошибка = Истина;
		СтруктураОтвета.ОписаниеОшибки = "Ошибка в дате";	 
	ИначеЕсли КодСостояния = 404 Тогда
		СтруктураОтвета.Ошибка = Истина;
		СтруктураОтвета.ОписаниеОшибки = "Данные не найдены";
	Иначе
		СтруктураОтвета.Ошибка = Истина;
		СтруктураОтвета.ОписаниеОшибки = "Код ответа: " + КодСостояния;
	КонецЕсли;
	
	Возврат СтруктураОтвета;
КонецФункции

&НаКлиенте
Процедура УчитыватьСтрануПриИзменении(Элемент)
	НастройкаВидимости();
КонецПроцедуры

&НаКлиенте
Процедура НастройкаВидимости()
	Элементы.Страна.Видимость = УчитыватьСтрану;
	
	Если НЕ УчитыватьСтрану Тогда
		Страна = "ru";
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	НастройкаВидимости();
КонецПроцедуры

// https://isdayoff.ru/today
// https://isdayoff.ru/tomorrow
// https://isdayoff.ru/now